DataProcessors/МастерСозданияИндивидуальнойНомры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>МастерСозданияИндивидуальнойНомры</Name>
			<Comment>Использованы нормы физиологических потребностей в энергии и пищевых веществах для различных групп населения Российской Федерации 2008</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФизАктивности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеременностьКормление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияКрайнегоСевера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИскусственноеВскармливание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НормыНутриентов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нутриент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Нутриенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНутриентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанныхПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Comment>М - Мужчина, Ж - Женцина, [М,Ж]П - Подросток, БК - Беременные/Кормящие</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возраст</Name>
							<Comment>Взрослые(0 -  (18-29), 1 - (30-39), 2 - (40-59), 3 - &gt;60), Подростки (4 - (0-3 мес.), 5 - (4-6 мес.), 6 - (7-12 мес.), 7 - (1-2 года), 8 - (2-3), 9 - (3-7), 10 - (7-11), 11- (11-14), 12 - (14-18))</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаФизАктивности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нутриент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Нутриенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНутриента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНутриентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НормыПитания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>НормыПитания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество в лень</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НормыНутриентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Нутриент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нутриенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНутриентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ТипыНутриентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аминокислоты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витамины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Жиры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минералы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Углеводы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МакроНутриенты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НормыНутриентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>НормыНутриентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Калорийность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Белки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Углеводы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Нутриенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Нутриенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНутриентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БиологическиеФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Нарушения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарушение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНарушенийДисбалансаВитаминов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Симптом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СимтомыНарушений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МастерСозданияИндивидуальнойНомры/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Назад(Команда)
	
	ТекущийСписок = ИменаМакетовМР231243108;
	
	НавигацияПоМакетам(ТекущийСписок, -1);
	ОтобразитьТекущиеМакеты();
	
КонецПроцедуры 

&НаКлиенте
Процедура Вперед(Команда)
	
	ТекущийСписок = ИменаМакетовМР231243108;
	
	НавигацияПоМакетам(ТекущийСписок, 1);
	ОтобразитьТекущиеМакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанными(Команда)
	
	Отбор		 = Новый Структура("Категория, Возраст, ГруппаФизАктивности, ТипНутриента"); 	
	МассивТипов	 = ЗаполняемыеНутриенты.ВыгрузитьЗначения();
		
	Если Объект.Возраст < 18 Тогда
		Отбор.Категория = Объект.Пол + "П";
	Иначе
		Отбор.Категория = Объект.Пол;
	КонецЕсли; 	
	
	Отбор.ГруппаФизАктивности 	= Объект.ГруппаФизАктивности;
	Отбор.ТипНутриента			= МассивТипов;
	
	Если Объект.Возраст < 0.25 Тогда
		Отбор.Возраст = 4;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 0.5 Тогда
		Отбор.Возраст = 5;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 1 Тогда
		Отбор.Возраст = 6;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 2 Тогда
		Отбор.Возраст = 7;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 3 Тогда
		Отбор.Возраст = 8;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 7 Тогда
		Отбор.Возраст = 9;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 11 Тогда
		Отбор.Возраст = 10;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 14 Тогда
		Отбор.Возраст = 11;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 18 Тогда
		Отбор.Возраст = 12;
		Отбор.ГруппаФизАктивности 	= 0;
	ИначеЕсли Объект.Возраст < 30 Тогда
		Отбор.Возраст = 0;
	ИначеЕсли Объект.Возраст < 40 Тогда
		Отбор.Возраст = 1;
	ИначеЕсли Объект.Возраст < 60 Тогда
		Отбор.Возраст = 2;  		
	ИначеЕсли Объект.Возраст >= 60 Тогда
		Отбор.Возраст 				= 3;
		Отбор.ГруппаФизАктивности 	= 0;
	КонецЕсли;  		
	
	ЗаполнитьДаннымиНаСервере(Отбор);
	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьИндивидуальнуюНорму(Команда)
	СоздатьИндивидуальнуюНормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборТиповНутриентов(Команда)
	
	ОткрытьФорму("Обработка.МастерСозданияИндивидуальнойНомры.Форма.ФормаВыбораЗаполняемыхНутриентов", 
								Новый Структура("СписокТиповНутриентов", ЗаполняемыеНутриенты.ВыгрузитьЗначения()), ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВозрастПриИзменении(Элемент)
	
	Элементы.ГруппаФизАктивности.Доступность 	= Объект.Возраст > 18;  		
	Элементы.ГруппаДетиДоГода.Доступность 		= Объект.Возраст < 1;
	
	ПриИзмененииПараметровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	
	Элементы.БеременностьКормление.Доступность = Объект.Пол = "Ж" И Объект.Возраст > 8; 
	
	ПриИзмененииПараметровНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровНаСервере()
	
	
	
КонецПроцедуры  

&НаКлиенте
Процедура НормаПриИзменении(Элемент)
	НормаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НормаПриИзмененииНаСервере()  	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыПитания.Нутриент,
		|	НормыПитания.Количество,
		|	НормыПитания.МинКоличество,
		|	НормыПитания.МаксКоличество,
		|	НормыПитания.Нутриент.Тип КАК Тип
		|ИЗ
		|	РегистрСведений.НормыПитания КАК НормыПитания
		|ГДЕ
		|	НормыПитания.Норма = &Норма";
	
	Запрос.УстановитьПараметр("Норма", Объект.Норма);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Показатели.Загрузить(РезультатЗапроса.Выгрузить());  	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пол 						= "М";
	Объект.БеременностьКормление 	= 0;
	Объект.Источник				 	= 1;
	
	Элементы.ГруппаФизАктивности.Доступность 		= Объект.Возраст > 18;  		
	Элементы.ИскусственноеВскармливание.Доступность = Объект.Возраст < 1;
	Элементы.БеременностьКормление.Доступность 		= Объект.Пол = "Ж";
	
	Для каждого Ит Из Метаданные.Перечисления.ТипыНутриентов.ЗначенияПеречисления Цикл
		ЗаполняемыеНутриенты.Добавить(Перечисления.ТипыНутриентов[Ит.Имя]);	
	КонецЦикла; 
	
	ЗаполнитьСпискиЗначенийИменМакетов();  	
	ЗаполнитьДанныеПоказателейИзТабличныхДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьТекущиеМакеты(); 
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьТипыНутриентов(МассивЗаполнения) Экспорт
	
	ЗаполняемыеНутриенты.ЗагрузитьЗначения(МассивЗаполнения);	
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьДанныеПоказателейИзТабличныхДокументов()
	
	ЭтаОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтаОбработкаОбъект.ЗаполнитьПоказателиМужчины_МР231243108();
	ЭтаОбработкаОбъект.ЗаполнитьПоказателиЖенщины_МР231243108();
	ЭтаОбработкаОбъект.ЗаполнитьПоказателиПодростки_МР231243108();
	ЭтаОбработкаОбъект.ЗаполнитьПоказателиДополнительные_МР231243108();
	ЭтаОбработкаОбъект.ЗаполнитьПоказателиБАВ_МР231243108();
	
	ЗначениеВРеквизитФормы(ЭтаОбработкаОбъект, "Объект");
	
КонецПроцедуры   

&НаСервере
Процедура СоздатьИндивидуальнуюНормуНаСервере()
	
	Если ТипЗнч(Объект.Норма) = Тип("Строка") Тогда
		НормаОбъект 				= Справочники.НормыНутриентов.СоздатьЭлемент();
		НормаОбъект.Наименование 	= Объект.Норма;
	Иначе	
		НормаОбъект = Объект.Норма.ПолучитьОбъект();		
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Вт_Показтели.Нутриент КАК Нутриент,
	                      |	Вт_Показтели.Количество КАК Количество,
	                      |	Вт_Показтели.МинКоличество КАК МинКоличество,
	                      |	Вт_Показтели.МаксКоличество КАК МаксКоличество,
	                      |	Вт_Показтели.Тип КАК Тип
	                      |ПОМЕСТИТЬ Вт_ТекПкз
	                      |ИЗ
	                      |	&ТекущиеПоказатели КАК Вт_Показтели
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Вт_ТекПкз.Нутриент КАК Имя,
	                      |	СУММА(Вт_ТекПкз.Количество) КАК Количество
	                      |ИЗ
	                      |	Вт_ТекПкз КАК Вт_ТекПкз
	                      |ГДЕ
	                      |	(Вт_ТекПкз.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНутриентов.МакроНутриенты)
	                      |			ИЛИ Вт_ТекПкз.Нутриент = ЗНАЧЕНИЕ(Справочник.Нутриенты.Калорийность))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Вт_ТекПкз.Нутриент
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НЕОПРЕДЕЛЕНО КАК Норма,
	                      |	Вт_ТекПкз.Нутриент,
	                      |	СУММА(Вт_ТекПкз.Количество) КАК Количество,
	                      |	СУММА(Вт_ТекПкз.МинКоличество) КАК МинКоличество,
	                      |	СУММА(Вт_ТекПкз.МаксКоличество) КАК МаксКоличество
	                      |ИЗ
	                      |	Вт_ТекПкз КАК Вт_ТекПкз
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Вт_ТекПкз.Нутриент");
						  
	Запрос.УстановитьПараметр("ТекущиеПоказатели", Объект.Показатели.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРеквизитов  = РезультатЗапроса[1].Выбрать();
	ТаблицаПоказателей = РезультатЗапроса[2].Выгрузить();
	
	Пока ВыборкаРеквизитов.Следующий() Цикл
		НормаОбъект[Строка(ВыборкаРеквизитов.Имя)] = ВыборкаРеквизитов.Количество;			
	КонецЦикла; 	
	
	Попытка
		НормаОбъект.Записать();
		Объект.Норма = НормаОбъект.Ссылка;		
	Исключение
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
	КонецПопытки; 

	ТаблицаПоказателей.ЗаполнитьЗначения(НормаОбъект.Ссылка, "Норма");
	
	Набор = РегистрыСведений.НормыПитания.СоздатьНаборЗаписей();
	Набор.Отбор.Норма.Установить(НормаОбъект.Ссылка);
	Набор.Загрузить(ТаблицаПоказателей);
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиЗначенийИменМакетов()
	
	Пометка = Истина;
	Для каждого Ит Из Метаданные.Обработки.МастерСозданияИндивидуальнойНомры.Макеты Цикл 		
		
		Если Найти(Ит.Имя, "МР231243108") > 0 Тогда
			ИменаМакетовМР231243108.Добавить(Ит.Имя, Ит.Синоним, Пометка);	
			Пометка = Ложь;
		КонецЕсли; 
		
	КонецЦикла; 	
		
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеМакета(ИмяМакета)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Результат 		= ОбъектОбработки.ПолучитьМакет(ИмяМакета);	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ОтобразитьТекущиеМакеты()

	Для каждого Ит Из ИменаМакетовМР231243108 Цикл
		Если Ит.Пометка Тогда
			ТабличныйДокумент = ПолучитьДанныеМакета(Ит.Значение);
			Если ТабличныйДокумент <> Неопределено Тогда
				ТДМР231243108 						= ТабличныйДокумент;
				Элементы.ТДМР231243108.Заголовок 	= Ит.Представление;
			КонецЕсли; 
			Прервать;
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоМакетам(Список, Сдвиг)
	
	КоличествоЭлементов = Список.Количество() - 1;
	ТекущийНомер = 0;
	Для Сч = 0 По КоличествоЭлементов Цикл
		Если Список[Сч].Пометка Тогда
			Список[Сч].Пометка = Ложь;
			ТекущийНомер = Сч;
			Прервать;	
		КонецЕсли; 	
	КонецЦикла;  
	
	НовыйНомер = ТекущийНомер + Сдвиг;
	Если НовыйНомер > КоличествоЭлементов Тогда
		НовыйНомер = 0;  	
	КонецЕсли; 
	
	Если НовыйНомер < 0 Тогда
		НовыйНомер = КоличествоЭлементов;
	КонецЕсли;
	
	ИменаМакетовМР231243108[НовыйНомер].Пометка = Истина; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере(ОтборОсновной)
	
	МассивНЗМРГ = Новый Массив; //массив нутриентов, зависящих от массы у ребенка до года
	МассивНЗМРГ.Добавить(Справочники.Нутриенты.Калорийность);
	МассивНЗМРГ.Добавить(Справочники.Нутриенты.Белки);
	МассивНЗМРГ.Добавить(Справочники.Нутриенты.Жиры);
	МассивНЗМРГ.Добавить(Справочники.Нутриенты.Углеводы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Категория КАК Категория,
	               |	Данные.Возраст КАК Возраст,
	               |	Данные.ГруппаФизАктивности КАК ГруппаФизАктивности,
	               |	Данные.Нутриент КАК Нутриент,
	               |	Данные.Количество КАК Количество,
	               |	Данные.ТипНутриента КАК ТипНутриента,
	               |	Данные.МинКоличество КАК МинКоличество,
	               |	Данные.МаксКоличество КАК МаксКоличество,
	               |	ВЫБОР
	               |		КОГДА Данные.Возраст > 3
	               |				И Данные.Возраст < 7
	               |				И Данные.Нутриент В (&МассивНЗМРГ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ИВ = ИСТИНА
	               |						ТОГДА &Масса
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИВ,
	               |	ВЫБОР
	               |		КОГДА &УКС = ИСТИНА
	               |				И Данные.Возраст < 4
	               |			ТОГДА 1.15
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК УКС
	               |ПОМЕСТИТЬ Вт_Данные
	               |ИЗ
	               |	&Данные КАК Данные
	               |ГДЕ
	               |	Данные.ТипНутриента В(&ТипНутриента)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_Показтели.Нутриент КАК Нутриент,
	               |	Вт_Показтели.Количество КАК Количество,
	               |	Вт_Показтели.МинКоличество КАК МинКоличество,
	               |	Вт_Показтели.МаксКоличество КАК МаксКоличество,
	               |	Вт_Показтели.Тип КАК Тип
	               |ПОМЕСТИТЬ Вт_ТекПкз
	               |ИЗ
	               |	&ТекущиеПоказатели КАК Вт_Показтели
	               |ГДЕ
	               |	НЕ Вт_Показтели.Тип В (&ТипНутриента)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_Данные.Нутриент,
	               |	Вт_Данные.Количество * Вт_Данные.УКС * Вт_Данные.ИВ КАК Количество,
	               |	Вт_Данные.МинКоличество * Вт_Данные.УКС * Вт_Данные.ИВ КАК МинКоличество,
	               |	Вт_Данные.МаксКоличество * Вт_Данные.УКС * Вт_Данные.ИВ КАК МаксКоличество,
	               |	Вт_Данные.ТипНутриента КАК Тип
	               |ПОМЕСТИТЬ Вт_Рассчитанные
	               |ИЗ
	               |	Вт_Данные КАК Вт_Данные
	               |ГДЕ
	               |	Вт_Данные.Категория = &Категория
	               |	И Вт_Данные.Возраст = &Возраст
	               |	И Вт_Данные.ГруппаФизАктивности = &ГруппаФизАктивности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Нутриент КАК Нутриент,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.МинКоличество,
	               |	ВложенныйЗапрос.МаксКоличество,
	               |	ВложенныйЗапрос.Тип КАК Тип
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Нутриент КАК Нутриент,
	               |		ВложенныйЗапрос.Количество КАК Количество,
	               |		ВложенныйЗапрос.МинКоличество КАК МинКоличество,
	               |		ВложенныйЗапрос.МаксКоличество КАК МаксКоличество,
	               |		ВложенныйЗапрос.Тип КАК Тип
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Вт_Данные.Нутриент КАК Нутриент,
	               |			Вт_Данные.Количество КАК Количество,
	               |			Вт_Данные.МинКоличество КАК МинКоличество,
	               |			Вт_Данные.МаксКоличество КАК МаксКоличество,
	               |			Вт_Данные.Тип КАК Тип
	               |		ИЗ
	               |			Вт_Рассчитанные КАК Вт_Данные
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			Вт_Данные.Нутриент,
	               |			Вт_Данные.Количество,
	               |			Вт_Данные.МинКоличество,
	               |			Вт_Данные.МаксКоличество,
	               |			Вт_Данные.ТипНутриента
	               |		ИЗ
	               |			Вт_Данные КАК Вт_Данные
	               |		ГДЕ
	               |			Вт_Данные.Категория = ""БК""
	               |			И Вт_Данные.ГруппаФизАктивности = &БеременностьКормление) КАК ВложенныйЗапрос
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ                       
	               |		Вт_ТекПкз.Нутриент,
	               |		Вт_ТекПкз.Количество,
	               |		Вт_ТекПкз.МинКоличество,
	               |		Вт_ТекПкз.МаксКоличество,
	               |		Вт_ТекПкз.Тип
	               |	ИЗ
	               |		Вт_ТекПкз КАК Вт_ТекПкз) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	(ВложенныйЗапрос.Количество > 0
	               |			ИЛИ ВложенныйЗапрос.МаксКоличество > 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Тип,
	               |	Нутриент";	
				   
	Для каждого Ит Из ОтборОсновной Цикл
		Запрос.УстановитьПараметр(Ит.Ключ, Ит.Значение);		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("Данные", Объект.ТаблицаДанныхПоказателей.Выгрузить());
	Запрос.УстановитьПараметр("ТекущиеПоказатели", Объект.Показатели.Выгрузить());
	Запрос.УстановитьПараметр("БеременностьКормление", Объект.БеременностьКормление);
	Запрос.УстановитьПараметр("УКС", Объект.УсловияКрайнегоСевера);
	Запрос.УстановитьПараметр("ИВ", Объект.ИскусственноеВскармливание);	
	Запрос.УстановитьПараметр("Масса", Объект.Масса);
	Запрос.УстановитьПараметр("МассивНЗМРГ", МассивНЗМРГ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Объект.Показатели.Загрузить(РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры
